# MinSkylightWidthMetric Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..MinSkylightWidthMetric Property
BuiltInFailures..::..MassFailures Class See Also
---
The minimum skylight width is 203.2 millimeters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MinSkylightWidthMetric { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MinSkylightWidthMetric As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MinSkylightWidthMetric {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace